package sa.edu.kau.fcit.cpit252.project.model;

import java.util.List;

public class Hajj implements Ritual {

    //return the name of the ritual
    @Override
    public String getName(){
        return "Hajj";
    }

    // return steps for hajj
    @Override
    public List<String> getSteps(){
        return List.of("الإحرام",
                "الميقات",
                "عند دخول مكة وبعد دخول المسجد الحرام",
                "طواف القدوم",
                "الفراغ من الطواف",
                "الصلاة عند مقام إبراهيم عليه السلام",
                "استلام الحجر الأسود",
                "السعي بين الصفا والمروة",
                "الحلق والتقصير",
                "يوم التروية؛ الثامن من ذي الحجة",
                "التوجه إلى منى",
                "يوم عرفة؛ التاسع من ذي الحجة",
                "الوقوف بعرفة",
                "ما يقال يوم عرفة",
                "التوجه إلى مزدلفة",
                "يوم العيد؛ يوم النحر العاشر من ذي الحجة",
                "الوصول إلى منى",
                "نحر الهدي",
                "الحلق أو التقصير",
                "التحلل الأول",
                "طواف الإفاضة (طواف الزيارة)",
                "الصلاة خلف مقام إبراهيم عليه السلام",
                "السعي بين الصفا والمروة",
                "الرجوع إلى منى",
                "وجوب الدم على المتمتع والقارن",
                "استحباب التزود من الطاعات",
                "طواف الوداع",
                "زيارة مسجد النبي صلى الله عليه وسلم",
                "استحباب زيارة البقيع ومسجد قباء",
                "زيارة شهداء أحد",
                "الصلاة في مسجد قباء",
                "ويقول عند عودته إلى بلاده");

    }
}
